app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
    @dbphotos = Photo.all

INSERT INTO "photos" ("title", "content", "date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Ici"], ["content", "oui oui"], ["date", "2019-02-22"], ["user_id", 1], ["created_at", "2019-02-22 11:09:44.048857"], ["updated_at", "2019-02-22 11:09:44.048857"]]
---
  def create
    if user_signed_in?
      @photo = Photo.new(photo_params)
      @photo.user_id = current_user.id
      @photo.save

UPDATE "photos" SET "long" = $1, "lat" = $2, "file" = $3, "updated_at" = $4 WHERE "photos"."id" = $5  [["long", -0.552455566406258], ["lat", 44.817353885814406], ["file", "txqhwohnqexpuwvikin0.jpg"], ["updated_at", "2019-03-13 14:01:22.581102"], ["id", 4]]
---
  def update
    if current_user.id == @photo.user_id
    respond_to do |format|
      if @photo.update(photo_params)

DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 2]]
---
  def destroy
    @user = @photo.user
    @photo.destroy