app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @photos = Photo.all